Frontend/css3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-22 周四 01:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>`CSS3</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">`CSS3</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1a428ef">1. 弹性盒子布局(flex)</a></li>
<li><a href="#orgad637d6">2. 媒体查询(Media Query)</a>
<ul>
<li><a href="#org56ec993">2.1. @import</a></li>
<li><a href="#orgb077904">2.2. @media</a></li>
</ul>
</li>
</ul>
</div>
</nav>




<section id="outline-container-org1a428ef" class="outline-2">
<h2 id="org1a428ef"><span class="section-number-2">1</span> 弹性盒子布局(flex)</h2>
<div class="outline-text-2" id="text-1">
<p>
css3 中引入的一个非常灵活，非常强大的布局方式。
</p>

<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">#container </span>{
    <span class="org-css-property">display</span>: flex;
    <span class="org-css-property">justify-content</span>: center;
}

<span class="org-css-selector">.item </span>{
    <span class="org-css-property">flex</span>: 1;
}
</pre>
</div>
</div>
</section>

<section id="outline-container-orgad637d6" class="outline-2">
<h2 id="orgad637d6"><span class="section-number-2">2</span> 媒体查询(Media Query)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org56ec993" class="outline-3">
<h3 id="org56ec993"><span class="section-number-3">2.1</span> @import</h3>
</div>
<div id="outline-container-orgb077904" class="outline-3">
<h3 id="orgb077904"><span class="section-number-3">2.2</span> @media</h3>
<div class="outline-text-3" id="text-2-2">
<p>
语法分为三部分:
</p>
<ol class="org-ol">
<li>Media 类型</li>
<li>Media 特性表达式</li>
<li>逻辑操作符</li>
</ol>

<p>
如下所示:
</p>
<div class="org-src-container">
<pre class="src src-css"><span class="org-comment-delimiter">/* </span><span class="org-comment">&#35821;&#27861; </span><span class="org-comment-delimiter">*/</span>
<span class="org-builtin">@media</span> not|only MediaType and (MediaFeatureExpressions) {
    CSS-Code;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">&#31034;&#20363; </span><span class="org-comment-delimiter">*/</span>
<span class="org-builtin">@media</span> print {
    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#21482;&#26377;&#22312;&#25171;&#21360;&#30340;&#26102;&#20505;&#65292;&#36825;&#20123;&#26679;&#24335;&#25165;&#20250;&#29983;&#25928; </span><span class="org-comment-delimiter">*/</span>
}

<span class="org-builtin">@media</span> screen, print {
    <span class="org-comment-delimiter">/* </span><span class="org-comment">Media Type &#20998;&#20026;4&#31181;&#65292;all/print/screen/speech </span><span class="org-comment-delimiter">*/</span>
}

<span class="org-builtin">@media</span> screen and (min-width: 480px) {
    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26174;&#31034;&#30340;&#26102;&#20505;&#65292;&#24182;&#19988;&#23631;&#24149;&#23485;&#24230;&#22823;&#20110; 480 &#30340;&#26102;&#20505;&#25165;&#29983;&#25928; </span><span class="org-comment-delimiter">*/</span>
}

<span class="org-builtin">@media</span> (min-height: 500px), (not (screen and ((color))) and (max-width: 90em) and (oritentation:lanscape)) {
    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#26356;&#22797;&#26434;&#30340;&#26465;&#20214; </span><span class="org-comment-delimiter">*/</span>
    <span class="org-comment-delimiter">/* </span><span class="org-comment">&#36923;&#36753;&#36816;&#31639;&#31526;&#21253;&#25324; and/not/only </span><span class="org-comment-delimiter">*/</span>
}
</pre>
</div>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-22 周四 01:50</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
